Revit 2027 API
BuiltInFailures.DimensionFailures.SpotDimensionReferencesNoLongerHorizontal Property
 One or more Spot Dimension references are no longer valid. Spot Dimensions can generally reference only those references which have valid coordinates in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpotDimensionReferencesNoLongerHorizontal { get; }
Public Shared ReadOnly Property SpotDimensionReferencesNoLongerHorizontal As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpotDimensionReferencesNoLongerHorizontal {
	FailureDefinitionId^ get ();
}
static member SpotDimensionReferencesNoLongerHorizontal : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace